{
    "logs": [
        {
            "guidelines": { 
                "clientbase_changelogs guide":"",
                "the change logs need the required details:":"",
                "- 'version' = Version number appears on the title part of every logs":"",
                "- 'description' = Version's short description":"",
                "this change logs must be on ascending order wherein the highest version is always on the top of the logs or after this guidelines":"",
                "this json file is sensitive when you put a wrong format, it can lead to errors on the clientbase-api change logs.":"",
                "\r\n symbol is for the next line":"",
                "NOTE!: DO NOT REMOVE THIS PART FOR DOCUMENTATION PURPOSE. PROCEED TO THE NEXT JSON.":""
                }
        },
        {
            "version": "4.5.1",
            "description": "Link Server status in Client Terminal Details to Unit Status module with the corresponding selected value."
        },
        {
            "version": "4.5.0",
            "description": "add additional check mark for marking indicating expired but still using service, should only be enabled for expired clients disabled for free and non expired (Still Used)\r\ndisabled on non expired clients, must still show as expired under expiration report\r\nadditonal column to show expired but still under nsi must check that mscs is not affected\r\nUpdate the module information of each client base modules\r\nHide the Hamachi and Clients Module"
        },
        {
            "version": "4.4.0",
            "description": "Add logs and allow viewing of accrediation in selection of accrediation when spm selected\r\nSPM ACCREDITATION additional field in PTU module - only for SPM\r\nTerminal dropdown in terminal module in clientbase should refresh with client branch selection\r\nfix deleted branches and networks showing\r\nCreate new feature in terminal module to display group id, network id, branch and reference number for faster and easier confirmation of incorrect detials\r\nOptimize loading of client group module in clientbase\r\nAdding information for each module we have in Clientbase\r\nRemoving the table with information of the modules\r\nNew Seperators(Tools, Reports, Others) for control panel in clientbase\r\nReports only has reports\r\nTools should contain modules where input can be done\r\nOthers - place other modules - announcement, sql queries etc..."
        },
        {
            "version": "4.3.0",
            "description": "Additional Filter for Software Type and Error Type in Generated Error Reports Module\r\nadjust order by position\r\nAdd specific user for clientbase for Terminal Manager application (200 & 201)\r\ndouble check if terminal manager related apis have last modified by must still accept old values standardize\r\nAlmost same as Generated Error Reports, name as Terminal Manager Error Reports get data from clientterminal error log default to one week as large data set from and to\r\nAdd time for the `From` and `To` date picker\r\nRemove or update deadend links in clientbase ( Contact Us, Account Settings)\r\nupdate version for small and large font\r\nhide developer guide\r\nUpdate System Logs Module in Clientbase to reflect new logs\r\nrefer to clientbase logs folder\r\nmake it dynamic to detect easier in the future"
        },
        {
            "version": "4.2.0",
            "description": "Add documentation for all existing APIs\r\nAdding change logs and versioning for Clientbase and Clientbase-API"
        },
        {
            "version": "4.1.0",
            "description": "must have icon in control panel\r\nCreate basic homepage wiki like website to store documentation\r\nResearch if there is nice template we can reuse if none create from scratch\r\nPreferrably to put data only json is needed to be filled up with formatting (similar to changelogs in websystem) but with sidebar for easy navigation"
        },
        {
            "version": "4.0.0",
            "description": "move code of PermitToUseAPI/getPTUDetails to nelsoft-clientbase-api project\r\nall units accessing client.nelsoft.ph PermitToUseAPI/getPTUDetails should be forwarded to client-api.nelsoft.ph PermitToUseAPI/getPTUDetails\r\nprovide new domain to c# team\r\nRecode getuuid API to be compatible to clientbase\r\nHost getuuid API to be compatible to clientbase"
        },
        {
            "version": "3.0.8",
            "description": "Add dropdown for project type in Network module, including add and editing\r\nDatabase change to add type\r\nDatafix to insert type value, base on the branches' terminals\r\nmust be able to save using manual input mode\r\nmerged and applied to master\r\nModify clientbase PTU API and sync to lettuce to add extension name after last name for owner value\r\nDecode html special codes into actual characteres\r\neach software should have hardcoded source options\r\nexample: cirms should have only 2 Cirms main branch and cirms staging branch\r\nthe version should be the latest version of each branch\r\nversion dropdown should be disabled because as of now only the latest version is can be supported by the feature\r\nShow=0 or deleted should show as cancelled and visible in js table\r\nFix issue wherein error message pops up ( There is an issue please see logs - should only appear when lower or equal version and cancelled)\r\nadd sample data for CIRMS Staging\r\nmust handle retail and retail staging\r\ndisable notif icon with badge to show number of unread/unclicked notifs(will be viewed in HDs' accounts only|notifs will be added once a client(new or old) was assigned/reassigned to him this is one possible cause of high cpu usage for apache\r\nadd new dropdown 'project' with options\r\nnew column with db change name as project_code\r\nadd project_code to the functions\r\nre run the whole process with adaptation of new params `project_code`\r\nAdjust project code spacing sql queries module\r\nAdd endpoint for PermitToUSEAPI\r\nCheck branchid parameter for multiple parameters/routes ticket must be clientbranch id (4th option) on all API\r\nAdd GETPTUAPI additional parameter: Client branchid + Term# + pos type"
        },
        {
            "version": "3.0.7",
            "description": "create new report in client base for backup reporting\r\nconnected to pos feature 0060233\r\nPOS will be uploading backups to Nelsoft's S3 cloud server. Client base can access the S3 cloud server files to check the latest backup uploaded by each unit.\r\ncollumns include\r\nwhen is the latest backup of each unit\r\nthe specific unit and which branch it is included in\r\ncritical units that hasn't uploaded any backup for a long time. \r\ncreate API to connect to Amazon AWS S3 to get relevant data\r\nModified to accept endpoint for devide id and uuid\r\nCreate a module for tagging and indication if the certain branch or unit is eligible for update and what version should the unit request\r\nCreate a report that will show list of changes done\r\nFirst Name, Middle Name and Last Name textbox should be a required field is Registered Name textbox is BLANK\r\nRegistered Name is required field if First Name, Middle Name and Last Name textbox is BLANK."
        },
        {
            "version": "3.0.6",
            "description": "Add restriction to user to not be able to upgrade position by not showing higher position in dropdown\r\nAdd filter to not show user who has higher position than login user in User List to prevent modification\r\nModify PermitToUseApi to change source table for Business name, Owner, Address, TIN for both PTU API and Lettuce\r\nChange Owner source, to get value from First, middle and last name first before the business address\r\n`Transaction No` - accepts blank value\r\n`Machine Setup` - accepts blank value\r\n`RDO Code``- accepts blank value\r\nthe rest of the fields are as is.\r\nAllow user to switch setup mode from **Automatic** to **POSD** and **VICE VERSA** even though the branch has a  terminal already bound to a PTU\r\n**STILL** users are **RESTRICTED** to change mode as long that the branch has a terminal bound to a PTU\r\n**Dual POS** into **Automatic** and *VICE VERSA*\r\n**Dual POS** into **POSD** and *VICE VERSA*\r\nModify branch filter to only include branch only, with monthly charge of more than zero"
        },
        {
            "version": "3.0.5",
            "description": "Additional module 'Generated Error Reports'.\r\ncontains list of error details saved by API.\r\nDatabase table for retrieval of data is `error_reports`\r\nList is group by and sorted by `Client Group` AND `Client Network` AND `Branch ID` AND `Date/Time`. \r\nFields in modal form are dynamic and should adaptive in the contents of error reports."
        },
        {
            "version": "3.0.4",
            "description": "If user choose 'DUAL POS' setup in a specific branch, duplicate PTU information are allowed within that branch's terminal.\r\nDropdown style is `chosen`, can select and bind multiple terminals in a single PTU info\r\nDisabled changing of **Setup** mode if there's a terminal bound to a PTU\r\nIf user chooses 'Automatic' setup in a specific branch, duplicate PTU information is prohibited within that branch's terminal.\r\nDropdown style changes to dropdown selection where user can select 1 terminal at a time per PTU info\r\nDisabled changing of **Setup** mode if there's a terminal bound to a PTU\r\nIf user chooses 'POSD Generator' setup in a specific branch, duplicate PTU information is prohibited within that branch's terminal.\r\nDropdown style changes to dropdown selection where user can select 1 terminal at a time per PTU info\r\nDisabled changing of **Setup** mode if there's a terminal bound to a PTU\r\nNew module `'Certificates of Registration (2303)'` in Control Panel. \r\n*See image attached `2303_CONTROL_PANEL.jpg`*\r\nList View and Add\r\n**Search Filters: (`2303_LISTVIEWWITHSTATUS.jpg`)**\r\n**String by** `Business Name`, `Address`, `Owner`, `TIN #` and `Dates *(Registration or Uploaded)*`\r\n**Order by (with ASC and DESC)** `ID`, `TIN #`, `Registration Date` or `Date Uploaded`\r\n**Type** *`(ALL, Available and Used)`*\r\n**Table Columns (`2303_LISTVIEWWITHSTATUS.jpg`), (`2303_LISTVIEW_ADDNEW.jpg`) and (`2303_LISTVIEW_EDIT.jpg`)**\r\n`Status` icon - circle with color icon to indicate status. (Same design in terminal module). \r\nThis icon is clickable and upon click there will be a prompt message to inform user **'Do you want to change to 'Active/Inactive'?'**\r\nChanging status doesn't require to be in edit mode state. User's can change the status without clicking the gear icon (Same design and flow in terminal module)\r\n`ID` - Primary Key, Numerical, db generated\r\n`Business Name` - String\r\n`Owner` - String\r\n`TIN` - Numerical, should be compatible with 3, 4 and 5 digits TIN Branch Code\r\n`Vat Status` - String, dropdown selection\r\n`Registration Date` - Date Selector Textbox\r\n`Attachments`  - ~~Browse button upon add new. Will change to Document Icon after saving entry.~~ Leave it as document icon as of now. Allow saving changes even though no COR attachment uploaded.\r\n**(TOOLTIP)** upon mouse hover within 1 sec to a specific row:\r\n`Date Created` - System Generated Date, date and time of creation. ***(NEW COLUMN in table `clientdetails_cor_list`)***\r\n`Created By` - User who created the entry. ***(NEW COLUMN in table `clientdetails_cor_list`)***\r\n`Last Modified By` - User who recently made a changes to the entry.\r\n`Last Modified By` - System Generated Date, date and time of last changes.\r\n**LOGS** . *See file attached `2303_LISTVIEW_WITHSTATUS_TOOLTIP.jpg`*\r\nGenerate Logs for ADD ENTRY. *See image attached `2303_LOGS_ADDNEW.JPG`*\r\nGenerate Logs for EDIT ENTRY. *See image attached `2303_LOGS_EDIT.JPG`*\r\nGenerate Logs for DELETE ENTRY. *See image attached `2303_LOGS_DELETE.JPG`*\r\n**database change (`clientdetails_attachments`)** - add new column `remarks` \r\nAdd validation in COR module where user cannot save the entry if there's no image attached before saving the changes.\r\nUpload attachment feature supports image types only.\r\nDuring adding new entry, instead of document icon there will be a browse file button for the user to be able to upload attachment. Upon clicking of save button, attachment will be saved. ***Required at least 1 attachment before allowing to save changes***. *See image attached `2303_LISTVIEW_ADDNEW_WITHSTATUS.JPG`*\r\nAfter saving changes, **DOCUMENT** icon will appear and it will turn into a clickable modal form. *See image attached `2303_LISTVIEW_WITHSTATUS.JPG`*\r\n**Reminders** \r\nlogs should be updated after saving\r\nDocument icon will appear after saving changes\r\nDuring edit, document icon will still display as is. If the user want to modify the attachments, they need to click the document icon to proceed in modal form\r\nUpon clicking of **Document** icon:\r\nUsers should be able to see the initially uploaded image attachment. No value for Name and Remarks for the meantime while image filename should be indicated already in IMG columm. ***See image attached `2303_attachment_modalform.jpg`***\r\nUsers should be able to upload multiple image attachments using **Browse** and **Upload** buttons. ***See image attached `2303_attachment_modalform.jpg` and  `2303_attachment_modalform_MULTIPLE.jpg` ***\r\nUsers can modify the attachment row by clicking edit icon to add labels for **Name** and **Remarks**. ***See image attached `2303_attachment_modalform1.jpg` and `2303_attachment_modalform2.jpg` ***\r\nUsers can preview the image attached by clicking the row in the table. Should be also able to magnify the image, just hover the mouse cursor to the image ***See image attached `2303_attachment_modalform_IMGPREVIEW.jpg`***\r\n**Delete** button per row - \r\nIf row is in edit mode, delete button will act as cancel edit mode.\r\nElse delete button will act as delete attachment\r\n**Validations** -\r\nThe system should restrict to delete all attachment in modal forms. There should be always at least 1 remaining attachment. Prompt ***'Deletion failed, there should be at least 1 image attachment per COR entry.'***\r\n**Image Upload limit (Validation)** - upon selecting attachment using file selector, there should be a validation that limits the user in selecting/uploading  images that will exceed in a total count of 6. *Regardless if the total count is from'Saved attachment + pending attachment **OR** total pending attachment **OR** total saved attachment'.* Prompt ***`'You have reached maximum number of attachments. You cannot add further. '`***\r\n**Maximum attachment reached** - in this scenario, disable **Browse** and **Upload Button**. If there's at least 1 available slot for attachment, **Browse** and **Upload Button** will be enable again.\r\nAdd UUID algorithm in clientbase terminal module\r\nTerminal new row **UUID** column will have values upon saving changes.\r\nEnabled 'extension=php_openssl.dll' on php.ini file\r\nImport COR data from COR Storage Module into COR Modal Form and enhancements in COR Module List-\r\nPrepare and create db changes for indicator of `Used` and `Available`.\r\nModify **'Import Other Branch COR'** for the ff. :\r\nUser must be able to import COR data created from COR Module.\r\nCOR from COR module should display in autocomplete via searching of TIN # or Business Name. Autocomplete limit is 10 entries.\r\nCOR from other branch should still display/searchable in textbox and usable.\r\nOnce COR is imported by a branch, it will be marked  as **Used** and can be import/shared by other branch within same client network"
        },
        {
            "version": "3.0.3",
            "description": "Add manual mode to input PTU head and PTU details\r\nMode is exclusive only for accounting position\r\nOnly the manually inputted can be edited by accounting position. Uploaded entries are restricted to modify by accounting and other users.\r\nSupport Multiple Image Attachment (COR modal form)\r\nremoved placeholder='Maximum 40 characters', set maxlength to 250"
        },
        {
            "version": "3.0.2",
            "description": "Change **Id** value of each row into clickable link.\r\nUpon click of clickable link **Id**, user will be redirected to a specific result row client details module.\r\nadded '-' to tin values in ptu api\r\nAdd sync functionality in binding function of HTML parser. It should check first if the terminal entry is 'Lettuce' POS Type then it will proceed to sync function API before saving the bind to database\r\nAdd loading indicator for duration of syncing process\r\nAdditional POS Types 'Lettuce Restaurant, Lettuce Fast Food, SPM and Self-Ordering Kiosk' in client terminal details module.\r\nModify 'Ref/Trm #' column in client terminal details module to support high number of values for Lettuce Cashier ID/Terminal No. \r\nModification in Client Branch PTU Modal Form**\r\nModify PTU head section where **Machine Setup** field will be considered as optional field upon validation of HTML file fields.\r\nOther functionalities will remain as is\r\nSample of SPM HTML Documents are already attached.\r\n**II. Modification in Client Branch PTU Modal Form**\r\nModify validation in parsing and upload html function where if **`MIN`** and **`ACC`** fields are blank, automatically the value that will be inputted in database is dash **`-`**.\r\n**III. ADDITIONAL Modification in Client Branch PTU Modal Form\r\n(`UPLOAD HTML PROCESS`)**\r\nModify upload function where if HTML document detected as **SPM**, check if document doesn't have **`ACC`**\r\nIF there's no **`ACC`**.\r\nGet list of ACC values within saved PTU DETAILS within same branch. \r\nIF ACC result = 1\r\ndisplay **PROMPT *(`popup_FINAL.jpg`)* ** \r\n**make the result as the default selected in the dropdown**. *User can still choose other option manually*\r\nThe selected **ACC** will be the value for the accreditation column in saving the ptu details. \r\nELSE IF ACC result >1\r\ndisplay **PROMPT *(`popup_FINAL.jpg`)* **\r\nand make the result  **'NONE'** as the default selected in the dropdown. *User can still choose other option manually*\r\nThe selected **ACC** will be the value for the accreditation column in saving the ptu details. \r\nELSE\r\ndisplay **PROMPT *(`popup_FINAL.jpg`)* ** \r\nmake the result  **'NONE'** as the default selected in the dropdown. *User can still choose other option manually*\r\nThe selected **ACC** will be the value for the accreditation column in saving the ptu details. \r\nELSE\r\nThe whole parsing and upload process are **AS IS**.\r\nfix issue where 'reference no. already used' checker doesn't filter entries with `show` column\r\nModify clientbase, add UUID column in client terminal details module\r\nFix logical issues that might affect the usability of Client base PTU HTML parser and bind\r\nAdditional restriction and enhancements in HTML PTU Parser and Client Terminal Details module\r\nadditional labels in ACC dropdown values for company name (omegaPOS, NSI, NTI, NTS etc)\r\nstring limitation in address textbox\r\nrestriction to edit terminal row details once the row entry is already bound\r\n30 characters limit per line,\r\nline limiter should separate words not by characters so therefore it may not reach the 30 characters before proceeding in next line\r\nAdd validations in client terminal module for Types and POS Types before saving as entry\r\nModify getPTUDetails to integrate changes for new parameter and output\r\nsupport 3 digit with 0 in prefix,  4 digit and 5 digit tin code in\r\ninput tin COR modal form\r\npermit to use API\r\nsync to lettuce\r\nRemove string 'ACC:' value from `accreditation_list`table. Apply adjustment in corresponding functions/modules\r\nApply revert of correcting accreditation field name in json output. Revert to 'Acc. #'"
        },
        {
            "version": "3.0.1",
            "description": "Modify clientbase PTU API to be compatible with HTML Parser Feature\r\nmodify the source table for the value of **`TIN`** and **`Vat Status`**. *It should be selecting data from **'clientdetails_cor_list'** , not from clientdetails*.\r\nAdd error return/response **('No COR Information')** if the details are the ff:\r\nIf any of these fields are blank or all these fields are blank **'(Business Name, Address and Owner)'**   AND\r\nIf any of these or both fields are set to '0' **(TIN and Vat Status)**\r\nIf all mentioned fields in above doesn't have information, considered lack of COR details and return error"
        },
        {
            "version": "3.0.0",
            "description": "NOTE! Not all the logs on this version has been encoded.\r\nnew popup for installation_type\r\ninclude teamviewer id, date of application and remark\r\nFix pagination issue in clientbase ( same logic as with master paging)\r\nFix bug in editing/transferring terminal data to other client\r\nApplied enter key as proceed in textboxes in 'Sys/Au/DB' Vermodal form in clientbase\r\nModify clientbase branch and terminal module for PTU API (adjust correct Tin format and accept special character for MIN etc...)\r\nnew page that can display queries that the tech can copy\r\nthey will then run the queries manually on the units\r\nthis is just as last resort if the client's unit really have no internet.\r\nAdd validation where user cannot enter same B.ID / Branch ID under same network in client base\r\nAdditional column in client branch in client base for 2303 info\r\ndb change add collumn in clientdetails for owner and businessname\r\nfix issue from HF_51420 where changing status of branch proceeds to blank effect\r\nAdd new accreditation for API\r\nAdd validation in PTU API for deleted data in clientterminaldetails table.\r\nAdd date created, last modified date and last modified by feature in clientbase\r\nAdd HTML file upload and parser function in Client Branch module\r\nAdd PTU Data/Preset loader to Client terminal details module.\r\nSanitized query to allow special characters in saving COR info\r\nAdd filter for status = 1 in clientbase PTU Api"
        }
    ]
}
